app/views/admin/items/edit.html.erb

    <div class="col-lg-4">
      <%= f.collection_select :genre_id, Genre.all, :id, :name, include_blank: "-- 選択して下さい --", class:"form-control" %>
---
SELECT "genres".* FROM "genres"