app/views/admin/items/new.html.erb

  <!--Genresのデータベースからカラムを引っ張って、プルダウンを実装するためのコード -->
  <%= f.collection_select :genre_id, Genre.all, :id, :name, include_blank: "-- 選択して下さい --" %>
---
SELECT "genres".* FROM "genres"