app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
      <div class="col-lg-4">
        <%= f.collection_select :genre_id, Genre.all, :id, :name, include_blank: "-- 選択して下さい --", class:"custom-select" %>