app/controllers/admin/customers_controller.rb

  def index
    @customers = Customer.all.page(params[:page]).per(10)
---
SELECT  "customers".* FROM "customers" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def update
    @customer = Customer.find(params[:id])
    @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "customers" SET "is_deleted" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_deleted", 0], ["updated_at", "2022-01-11 10:38:28.729932"], ["id", 3]]