app/controllers/admin/genres_controller.rb

SELECT "genres".* FROM "genres"
---
def index
  #ジャンル一覧を表示するための記述
  @genres = Genre.all

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "キャンディ"], ["created_at", "2022-01-13 11:07:38.164101"], ["updated_at", "2022-01-13 11:07:38.164101"]]
---
def create
  # １. データを新規登録するためのインスタンス作成
  genre = Genre.new(genre_params)
  binding.pry
  # ２. データをデータベースに保存するためのsaveメソッド実行
  genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def edit
  # findメソッドを用いて、データの取得
  @genre = Genre.find(params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "ケーキ(test)"], ["updated_at", "2022-01-03 14:46:14.027131"], ["id", 1]]
---
def update
  # 編集内容を送信し、データベースに保存・反映するアクションの作成
  genre = Genre.find(params[:id])
  genre.update(genre_params)