app/controllers/admin/items_controller.rb

INSERT INTO "items" ("genre_id", "name", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["genre_id", 2], ["name", "テストケーキ2"], ["introduction", "22222"], ["price", 2000], ["is_active", 1], ["created_at", "2021-12-23 20:26:04.731828"], ["updated_at", "2021-12-23 20:26:04.731828"]]
---
  def create
    # １. データを新規登録するためのインスタンス作成
    item = Item.new(item_params)
    # ２. データをデータベースに保存するためのsaveメソッド実行
    item.save

SELECT "items".* FROM "items"
---
  def index
    # itemデータベースから情報を取得
    @items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "items" SET "introduction" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["introduction", "テストケーキの説明文\r\nテスト編集ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ"], ["updated_at", "2021-12-05 00:43:59.988312"], ["id", 4]]
---
  def update
    item = Item.find(params[:id])
    item.update(item_params)