app/controllers/admin/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ? ORDER BY "order_details"."id" DESC LIMIT ? OFFSET ?  [["order_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
---
  def show
    @order = Order.find(params[:id])
    @order_details = @order.order_details.page(params[:page]).reverse_order