app/views/admin/orders/show.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <th>購入者</th>
    <td><%= @order.customer.last_name %> <%= @order.customer.first_name %></td>