app/views/admin/homes/top.html.erb

          <td>
            <%= order.customer.last_name %><%= order.customer.first_name %>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

            <% @sum = 0 %>
            <% order.order_details.each do |order_detail| %>
---
SELECT "orders".* FROM "orders"
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]