app/views/orders/new.html.erb

SELECT "addresses".* FROM "addresses"
---
        <div class="mb-2 pl-5">
          <%= f.select :address_id, options_from_collection_for_select(Address.all, :id, :full_address), class:"mt-3 ml-5 custom-select" %>