app/views/orders/new.html.erb

  <%= f.label :select_address_2, "登録済住所から選択" %>
  <%= f.select :address_id, options_from_collection_for_select(Address.all, :id, :full_address) %>
---
SELECT "addresses".* FROM "addresses"