app/controllers/addresses_controller.rb

  def index
    @addresses = current_customer.addresses.all
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 1]]

  def create
    # １. データを新規登録するためのインスタンス作成
    address = Address.new(address_params)
    address.customer_id = current_customer.id
    # ２. データをデータベースに保存するためのsaveメソッド実行
    address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["name", "宛先てすと1"], ["postal_code", "333333"], ["address", "埼玉県"], ["created_at", "2022-01-04 09:33:53.827545"], ["updated_at", "2022-01-04 09:33:53.827545"]]

  def update
    address = Address.find(params[:id])
    address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "address" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["address", "埼玉県川越市"], ["updated_at", "2022-01-04 09:47:31.202000"], ["id", 1]]

  def destroy
    address = Address.find(params[:id])
    address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 2]]