app/controllers/cart_items_controller.rb

SELECT SUM(subtotal) FROM "cart_items"
SELECT "cart_items".* FROM "cart_items"
---
  def index
    @cart_items = CartItem.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2021-12-25 07:32:43.589510"], ["id", 2]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 7]]
---
  def destroy_all
  CartItem.destroy_all