app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def mypage
    @customer = Customer.find(current_customer.id)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    # findメソッドを用いて、データの取得
    @customer = Customer.find(current_customer.id)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "email" = ?, "last_name" = ?, "last_name_kana" = ?, "first_name" = ?, "first_name_kana" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?
---
  def update
  # 編集内容を送信し、データベースに保存・反映するアクションの作成
  customer = Customer.find(current_customer.id)
  customer.update(customer_params)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "customers" SET "is_deleted" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_deleted", 1], ["updated_at", "2022-01-11 10:15:57.605688"], ["id", 3]]
---
  def withdrawal
    @customer = Customer.find(current_customer.id)
    # is_deletedカラムをtrueに変更することにより削除フラグを立てる
    @customer.update(is_deleted: true)