app/controllers/homes_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."created_at" DESC
---
  def top
    @items = Item.all