app/controllers/homes_controller.rb

  def top
    #Top画面の新着商品情報を４件のみ表示、かつ新着順にする
    @items = Item.limit(4).order(created_at: :desc)
---
SELECT  "items".* FROM "items" ORDER BY "items"."created_at" DESC LIMIT ?  [["LIMIT", 4]]