app/controllers/items_controller.rb

SELECT COUNT(*) FROM "items"
---
  def index
    @items = Item.all.page(params[:page]).per(8)