app/controllers/items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 4], ["updated_at", "2022-01-04 11:31:11.914518"], ["id", 1]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 4], ["customer_id", 2], ["amount", 1], ["created_at", "2021-12-29 06:31:36.125002"], ["updated_at", "2021-12-29 06:31:36.125002"]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 4], ["customer_id", 2], ["amount", 1], ["created_at", "2021-12-29 06:44:16.283974"], ["updated_at", "2021-12-29 06:44:16.283974"]]
---
    def create
    # １. データを新規登録するためのインスタンス作成
    cart_item = CartItem.new(cart_item_params)
    # ２. データをデータベースに保存するためのsaveメソッド実行
    if current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
      cart_item = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
      cart_item.amount += params[:cart_item][:amount].to_i
      cart_item.save
      redirect_to cart_items_path
    else
      cart_item.save