app/controllers/orders_controller.rb

  def index
    @orders = current_customer.orders.all
    @order_details = OrderDetail.all
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 2]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]

  def confirm
    @order = Order.new(order_params)
    if params[:order][:select_address] == '1'
      @order.postal_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.first_name + current_customer.last_name
    elsif params[:order][:select_address] == "2"
      @address = Address.find(params[:order][:address_id])
      @order.postal_code = @address.postal_code
      @order.address = @address.address
      @order.name = @address.name
    elsif params[:order][:address_number] == "3"
    else
      render :new
    end

    @cart_items = current_customer.cart_items.all
---
SELECT "addresses".* FROM "addresses"
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]

  def create
    cart_items = current_customer.cart_items.all
    @order = current_customer.orders.new(order_params)

    if @order.save
       cart_items.each do |cart|
        order_detail = OrderDetail.new
        order_detail.item_id = cart.item_id
        order_detail.order_id = @order.id
        order_detail.amount = cart.amount
        order_detail.price = cart.item.price
        order_detail.save
      end
      # きちんと動作するか一旦カートへ遷移。のちに「ありがとう」画面へ遷移するように変更
      redirect_to thanks_orders_path
      cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]
INSERT INTO "orders" ("customer_id", "postal_code", "address", "name", "shipping_cost", "total_payment", "payment_method", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "order_details" ("order_id", "item_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 1], ["item_id", 7], ["price", 300], ["amount", 5], ["created_at", "2022-01-05 09:42:50.746631"], ["updated_at", "2022-01-05 09:42:50.746631"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

  def show
    @order = Order.find(params[:id])
    @order_detail = OrderDetail.find_by(order_id: params[:id])
    @order_details = @order.order_details.page(params[:page])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ? LIMIT ?  [["order_id", 2], ["LIMIT", 1]]
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ? ORDER BY "order_details"."id" DESC LIMIT ? OFFSET ?  [["order_id", 2], ["LIMIT", 25], ["OFFSET", 0]]